Revit 2026 API
ControlledApplication.RegisterFailuresProcessor Method
 Registers Revit application-wide instance of Failures Processor.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static void RegisterFailuresProcessor(
	IFailuresProcessor processor
)
Public Shared Sub RegisterFailuresProcessor (
	processor As IFailuresProcessor
)
public:
static void RegisterFailuresProcessor(
	IFailuresProcessor^ processor
)
static member RegisterFailuresProcessor :
        processor : IFailuresProcessor -> unit
Parameters
processor IFailuresProcessor
 Instance of Failures Processor to be used by the Revit Application.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
Remarks
 If there is previously registered Failures Processor, it gets discarded. If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler for all Revit errors for the session. The standard Revit error dialog will not appear. If you want to handle only specific failures but not all types of failures in your application, subscribe to the FailuresProcessing event instead, or use FailuresPreprocessor interface for the specific transaction.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace